ThunderSloth/kirb-3/source/Kirb-3-MSPM0G3507/kirb-3.syscfg
SYSTICK.interruptEnable = true;
SYSTICK.periodEnable    = true;
SYSTICK.systickEnable   = true;
SYSTICK.period          = 2000000;

TIMER1.timerMode          = "PERIODIC_UP";
TIMER1.interrupts         = ["CC0_UP","LOAD","ZERO"];
TIMER1.$name              = "ULT_SCHED_TIM";
TIMER1.timerPeriod        = "60 ms";
TIMER1.timerClkSrc        = "MFCLK";
TIMER1.timerClkDiv        = 4;
TIMER1.peripheral.$assign = "TIMG12";

TIMER2.$name       = "ENC_SCHED_TIM";
TIMER2.timerMode   = "PERIODIC_UP";
TIMER2.timerClkSrc = "MFCLK";
TIMER2.timerPeriod = "10 ms";

UART1.$name                            = "UART_ESP32";
UART1.targetBaudRate                   = 115200;
UART1.enableFIFO                       = true;
UART1.enabledInterrupts                = ["RX"];
UART1.rxFifoThreshold                  = "DL_UART_RX_FIFO_LEVEL_ONE_ENTRY";
UART1.peripheral.rxPin.$assign         = "boosterpack.3";
UART1.peripheral.txPin.$assign         = "boosterpack.4";
UART1.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART1.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART1.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART1.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART1.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric10";
UART1.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART1.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART1.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART1.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric11";

UART2.$name                            = "UART_DEBUG";
UART2.targetBaudRate                   = 115200;
UART2.peripheral.rxPin.$assign         = "boosterpack.33";
UART2.peripheral.txPin.$assign         = "boosterpack.34";
UART2.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART2.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART2.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART2.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART2.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric19";
UART2.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART2.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART2.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART2.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric20";

UART3.targetBaudRate                       = 19200;
UART3.$name                                = "UART_ENCODER";
UART3.enabledDMARXTriggers                 = "DL_UART_DMA_INTERRUPT_RX";
UART3.enabledInterrupts                    = ["DMA_DONE_RX"];
UART3.rxTimeoutValue                       = 15;
UART3.peripheral.rxPin.$assign             = "boosterpack.11";
UART3.peripheral.txPin.$assign             = "boosterpack.17";
UART3.txPinConfig.direction                = scripting.forceWrite("OUTPUT");
UART3.txPinConfig.hideOutputInversion      = scripting.forceWrite(false);
UART3.txPinConfig.onlyInternalResistor     = scripting.forceWrite(false);
UART3.txPinConfig.passedPeripheralType     = scripting.forceWrite("Digital");
UART3.txPinConfig.$name                    = "ti_driverlib_gpio_GPIOPinGeneric6";
UART3.rxPinConfig.hideOutputInversion      = scripting.forceWrite(false);
UART3.rxPinConfig.onlyInternalResistor     = scripting.forceWrite(false);
UART3.rxPinConfig.passedPeripheralType     = scripting.forceWrite("Digital");
UART3.rxPinConfig.$name                    = "ti_driverlib_gpio_GPIOPinGeneric7";
UART3.DMA_CHANNEL_RX.addressMode           = "f2b";
UART3.DMA_CHANNEL_RX.configureTransferSize = true;
UART3.DMA_CHANNEL_RX.srcLength             = "BYTE";
UART3.DMA_CHANNEL_RX.dstLength             = "BYTE";
UART3.DMA_CHANNEL_RX.$name                 = "ENCODER_RX";
UART3.DMA_CHANNEL_RX.transferSize          = 2;
UART3.DMA_CHANNEL_RX.enableInterrupt       = true;

VREF.basicExtVolt           = 3.3;
VREF.basicIntVolt           = "DL_VREF_BUFCONFIG_OUTPUT_2_5V";
VREF.checkVREFReady         = true;
VREF.peripheral.$assign     = "VREF";
VREF.vrefPosPinConfig.$name = "ti_driverlib_gpio_GPIOPinGeneric17";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
pinFunction4.peripheral.$suggestSolution           = "SYSCTL";
pinFunction4.peripheral.hfxInPin.$suggestSolution  = "j17_expansion.4";
pinFunction4.peripheral.hfxOutPin.$suggestSolution = "j17_expansion.5";
ADC121.peripheral.$suggestSolution                 = "ADC0";
Board.peripheral.$suggestSolution                  = "DEBUGSS";
Board.peripheral.swclkPin.$suggestSolution         = "j25_expansion.16";
Board.peripheral.swdioPin.$suggestSolution         = "j25_expansion.14";
CAPTURE1.peripheral.ccp3Pin.$suggestSolution       = "boosterpack.2";
GPIO4.associatedPins[0].pin.$suggestSolution       = "boosterpack.35";
I2C1.peripheral.$suggestSolution                   = "I2C1";
PWM2.peripheral.$suggestSolution                   = "TIMG8";
SPI1.peripheral.$suggestSolution                   = "SPI1";
SPI1.peripheral.mosiPin.$suggestSolution           = "j19_expansion.5";
TIMER2.peripheral.$suggestSolution                 = "TIMG6";
UART1.peripheral.$suggestSolution                  = "UART1";
UART2.peripheral.$suggestSolution                  = "UART0";
UART3.peripheral.$suggestSolution                  = "UART2";
UART3.DMA_CHANNEL_RX.peripheral.$suggestSolution   = "DMA_CH0";
VREF.peripheral.vrefPosPin.$suggestSolution        = "j17_expansion.10";
